In [1]:
import pandas as pd

In [2]:
people = {
    'first':['Hussein' , 'Moataz' , 'Ekram'],
    'last' :['Sarea' , 'Ahmed' , 'Sarea'],
    'email':['zzzsdsd@dskd.com' , 'dsd@dsx.com' , 'zzz@dskd.com']
}

In [3]:
df = pd.DataFrame( data=people )
df

     first   last             email
0  Hussein  Sarea  zzzsdsd@dskd.com
1   Moataz  Ahmed       dsd@dsx.com
2    Ekram  Sarea      zzz@dskd.com

In [4]:
df['first'] + ' ' + df['last']

0    Hussein Sarea
1     Moataz Ahmed
2      Ekram Sarea
dtype: object

In [5]:
df['full_name'] = df['first'] + ' ' + df['last']
df

     first   last             email      full_name
0  Hussein  Sarea  zzzsdsd@dskd.com  Hussein Sarea
1   Moataz  Ahmed       dsd@dsx.com   Moataz Ahmed
2    Ekram  Sarea      zzz@dskd.com    Ekram Sarea

In [6]:
# df.drop( columns='first' )
df.drop( columns=['first' , 'last']  , inplace=True)
df

              email      full_name
0  zzzsdsd@dskd.com  Hussein Sarea
1       dsd@dsx.com   Moataz Ahmed
2      zzz@dskd.com    Ekram Sarea

In [7]:
df[ ['first' , 'last'] ] = df['full_name'].str.split(' ' , expand=True)
df

              email      full_name    first   last
0  zzzsdsd@dskd.com  Hussein Sarea  Hussein  Sarea
1       dsd@dsx.com   Moataz Ahmed   Moataz  Ahmed
2      zzz@dskd.com    Ekram Sarea    Ekram  Sarea

In [8]:
df.append( {
    'first' : 'Mike',
    'last' : 'White',
    'email' : 'zdsjshd@dshjd.com'
}  , ignore_index=True)

               email      full_name    first   last
0   zzzsdsd@dskd.com  Hussein Sarea  Hussein  Sarea
1        dsd@dsx.com   Moataz Ahmed   Moataz  Ahmed
2       zzz@dskd.com    Ekram Sarea    Ekram  Sarea
3  zdsjshd@dshjd.com            NaN     Mike  White

In [9]:
people = {
    'first':['Ahmed' , 'Shekah'],
    'last' :['Sarea' , 'Ahmed'],
    'email':['Ahmed1252@dskd.com' , 'ssshe@gmail.com']
}
df2 = pd.DataFrame(people)

In [10]:
df2

    first   last               email
0   Ahmed  Sarea  Ahmed1252@dskd.com
1  Shekah  Ahmed     ssshe@gmail.com

In [11]:
#We can also add a new row using the DataFrame.append() function
df = df.append(df2 , ignore_index=True)
df

                email      full_name    first   last
0    zzzsdsd@dskd.com  Hussein Sarea  Hussein  Sarea
1         dsd@dsx.com   Moataz Ahmed   Moataz  Ahmed
2        zzz@dskd.com    Ekram Sarea    Ekram  Sarea
3  Ahmed1252@dskd.com            NaN    Ahmed  Sarea
4     ssshe@gmail.com            NaN   Shekah  Ahmed

In [12]:
df.drop(index=0 , inplace=True) #remove row
df

                email     full_name   first   last
1         dsd@dsx.com  Moataz Ahmed  Moataz  Ahmed
2        zzz@dskd.com   Ekram Sarea   Ekram  Sarea
3  Ahmed1252@dskd.com           NaN   Ahmed  Sarea
4     ssshe@gmail.com           NaN  Shekah  Ahmed

In [13]:
filt = (df['last'] == 'Sarea')
indices = df[filt].index

In [14]:
df.drop(index = indices)

             email     full_name   first   last
1      dsd@dsx.com  Moataz Ahmed  Moataz  Ahmed
4  ssshe@gmail.com           NaN  Shekah  Ahmed

In [15]:
df

                email     full_name   first   last
1         dsd@dsx.com  Moataz Ahmed  Moataz  Ahmed
2        zzz@dskd.com   Ekram Sarea   Ekram  Sarea
3  Ahmed1252@dskd.com           NaN   Ahmed  Sarea
4     ssshe@gmail.com           NaN  Shekah  Ahmed

In [24]:
data = {
    'Name':['Martha', 'Tim', 'Rob', 'Georgia'],
    'Maths':[87, 91, 97, 95],
    'Science':[83, 99, 84, 76]
}
df1 = pd.DataFrame(data)
df1

      Name  Maths  Science
0   Martha     87       83
1      Tim     91       99
2      Rob     97       84
3  Georgia     95       76

In [25]:
data = {
    'Name':['Amy', 'Mady'],
    'Maths':[87, 91],
    'Science':[83, 99]
}
df2 = pd.DataFrame(data)
df2

   Name  Maths  Science
0   Amy     87       83
1  Mady     91       99

In [37]:
"""
We can also add multiple rows using the pandas.concat() 
by creating a new dataframe of all the rows that we need to add 
and then appending this dataframe to the original dataframe.
"""
df3 = pd.concat( [df1 , df2] , ignore_index=True)
df3

      Name  Maths  Science
0   Martha     87       83
1      Tim     91       99
2      Rob     97       84
3  Georgia     95       76
4      Amy     87       83
5     Mady     91       99

In [54]:
df3.iloc[-2: , :2]
df3.loc[-2: , :'Maths']

      Name  Maths
0   Martha     87
1      Tim     91
2      Rob     97
3  Georgia     95
4      Amy     87
5     Mady     91